#!/usr/bin/env python
# -*- coding: utf-8 -*-
# Created by Baoyi on 2018/3/26

import termcolor


def func_help():
    info = "\n" \
           "*************************************************************************\n" \
           "**\n" \
           "**  home:         查看主页(默认参数) 可以设置下面四个参数(不设置或者设置任意个数)\n" \
           "**  -c:           设置每页条数, 例如 home -c=20 代表每页显示20条(默认十条)\n" \
           "**  -p:           设置页数, 例如 home -p=2 代表显示第二页(默认第一页)\n" \
           "**  -f:           设置微博类型, 0：全部、1：原创、2：图片、3：视频、4：音乐，默认为0\n" \
           "**  -m:           设置图片模式,默认0表示不显示图片信息, -m=1 显示连接, -m=2 显示缩略图, -m=3 显示原图 \n" \
           "**  num -p -c:    数字代表你想看的微博序号, -c, -p 意义同上 例如 9 -c=20 -p=2\n" \
           "**  p:            表示向前翻页\n" \
           "**  n:            表示向后翻页\n" \
           "**  pwd:          查看当前位置 home 或者 detail\n" \
           "**  clear:        清屏\n" \
           "**  exit:         退出系统\n" \
           "**\n"
    print(termcolor.colored(info, 'green'))
